{% for src in design.rtl.sources %}
{%- if src.type == 'verilog' %}
read_verilog -noautowire {%- if src.variant == 'systemverilog' %} -sv {% endif %} {{src}}
{%- endif %}
{%- endfor %}

prep -top {{design.rtl.top}}
hierarchy -check -simcheck -top {{design.rtl.top}}
opt
check {{rtl_check_flags}} -assert
write_json yosys_rtl.json

synth_{{fpga.family}} {{synth_opts}} -top {{design.rtl.top}}
write_json netlist.json