{% for src in design.rtl.sources %}
read_verilog {{src}}
{% endfor %}

hierarchy -check -top {{design.rtl.top}} 
flatten
opt -fine -full
synth_{{fpga.family}} {{synth_opts}} -top {{design.rtl.top}}
opt -fine -full
write_json {{design.name}}.json